app/controllers/movies_controller.rb

  def create
    params.permit!
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Men in Black"], ["rating", "PG-13"], ["release_date", 2016-09-24 00:00:00 UTC], ["created_at", 2016-09-24 15:53:51 UTC], ["updated_at", 2016-09-24 15:53:51 UTC]]